'''
Програма повинна запитати "Який найпопулярніший колір у світі?".
Правильна відповідь - "синій" (всі букви маленькі). 
Якщо колір вірний, програма друкує "Вгадано!". 
У разі неправильного кольору друкує "Не вгадано! Спробуйте ще раз!" 
і знову пропонує ввести колір.


'''
yes = "Вгадав!"
no = "Не вгадав! Спробуй ще раз!"
answer = "синій"
color = input("Який найпопулярніший колір у світі?").lower()
while answer != color:
    print (no)
    color = input ("Який найпопулярніший колір у світі?").lower()
print (yes)



