'''
Бонусне завдання. 
Придумайте свою гру-загадку! 
Не соромтеся експериментувати з тими командами, які Ви вже знаєте!
Обов'язково придумайте і використовуйте свою власну ідею! 
'''
print("Гра загадка:")
guess = int(input("Скільки разів на день сміється в середньому дитина?"))
while guess not in range(150, 401):
    print("Подумайте скільки разів на годину сміється ваша внутрішня дитина")
    tip = int(input("?"))
    print("Спробуйте це число:")
    print(tip*16)
    guess = int(input("Скільки разів на день сміється в середньому дитина?"))
print("Вгадали!")