'''
Бонусне завдання. 
Придумайте свій діалог з комп'ютером! 
Нехай комп'ютер ставить запитання користувачеві, а той йому відповідає. 
Не соромтеся експериментувати з командами, які Ви вже знаєте!
Обов'язково придумайте і використовуйте свою власну ідею! 
Просто реалізуйте свою задумку.
'''
a = input("Привіт, як справи?").lower()

if a == "добре":
    b = input("Який ваш улюблений колір?")
    c = input("Скільки вам років?")
    print(f"У вас справи ідуть добре, бо вам тільки {c} років і ви любите {b}.")
elif a == "погано":
    d = input("А яка причина?")
    e = input("Що вам приносить радість?")
    print(f"Для того, щоб все не було погано через {d}, використайте {e}.")
else:
    print("Цікаво!")
    f = input("І давно це у вас?")
    g = input("Хто буде підливати вазонки?")
    print(f"Поки у вас все {a} вже {f} часу, {g} буде підливати вазонки!")