'''
Бонусне завдання. 
Придумайте свій чат-бот! 
Не соромтеся експериментувати з командами, які Ви вже знаєте!
Обов'язково придумайте і використовуйте свою власну ідею! 
'''
import random
print("Інтерактивний чат-бот мотиватор:")
print("")
print("Бот: Привіт!")


def get_advice():
    choice = input("Бот: Хочеш поговорити? Так (1) Ні (2)?")
    if choice == "1":
        print("Бот:Я знаю безліч порад. Чи є щось, що тебе турбує?")
        question = input("\n")
        advice = [ "Якщо вам стало сумно, спробуйте посміятися над собою. Але не забудьте, що сусіди можуть дивитися дивно.",
                "Якщо ваше життя складається з лимонів, додайте трішки цукру і води – і ви отримаєте лимонад. Якщо не вийшло, то, мабуть, ви щось робите не так.",
                "Якщо ви не можете знайти вихід з лабіринту, спробуйте розглядати його з іншого кута. Можливо, це не лабіринт, а просто плитка на підлозі.",
                "Не переймайтеся своїми невдачами – невдача – це просто можливість знайти новий шлях до успіху. І ще можливість розповісти геройську історію про свої провали.",
                "Якщо ви вирішили пробігти марафон, не забудьте взяти з собою взуття. Це робить біг значно комфортнішим, особливо якщо ви не любите камінчики.", 
                "Пам'ятайте, що сміх – це найкращий тренажер для м'язів обличчя. Регулярні тренування сміхом роблять ваш обличчя привабливішим.", 
                "Якщо ви вирішили стати супергероєм, не забудьте вибрати собі позитивний імідж. Наприклад, Капітан Усмішка або Щасливий Метеорит."
                ]
        advice = random.choice(advice)
        print(f"Бот: {advice}")
        get_advice()
    else:
        print("Бот: тоді до зустрічі!")
get_advice()
        
