'''
Придумайте свій діалог з комп'ютером!

Обов'язково придумайте і використовуйте свою власну ідею!

Використовуйте вкладені умовні оператори.
Питання, які задає комп'ютер, повинні змінюватися в залежності 
від попередніх відповідей людини.
'''
print("Скажіть щось комп'ютеру:")
print("1-Скільки буде 2 на 2?")
print("2-Сьогодні дуже гарна погода.")
print("3-Коли наступна гра збірної України з футболу?")

choice = input("Ваш вибір?")

if choice == "1":
    print("4")
    print("Комп'ютер: А скільки буде 156 на 278?")
    print("Комп'ютер: Варіантів не буде.")
    print("Комп'ютер: Ви мені теж не дали варіантів.")
    print("Комп'ютер: Все по чесному.")
    calc = input("?")
    if calc == 156*278:
        print("Комп'ютер: Вундеркінд!")
    else:
        print("Комп'ютер: 1:0 я виграв!")
elif choice == "2":
    print("Комп'ютер: Я думаю, що ти маєш рацію.")
    weather = input("Комп'ютер: Розкажи більше -")
    print("Комп'ютер: Буду знати.")
else:
    print("Комп'ютер: 21.03.2024 гра Боснія-Герцеговина - Україна.")
    print("Комп'ютер: Кваліфікація Чемпіонату Європи.")
    yes = input("Комп'ютер: Будеш дивитись? Так(1), Ні(2)?")
    if yes == "1":
        print("Комп'ютер: Справжній українець!")
    else:
        what = input("Комп'ютер: А що будеш робити?Розкажи -")
        print(f"Комп'ютер: {what} ? Теж непогано:)")

