'''
Заведіть змінну answer і запишіть туди правильну відповідь.
Використовуйте функцію input, щоб загадати загадку користувачеві
і записати його відповідь в нову змінну.

В умовному операторі порівняйте відповідь користувача з answer. 
Якщо відповідь вірна, то привітайте користувача з правильною відповідю. 
Якщо немає - висловіть співчуття.

'''
answer = "білка"
guess = input("Тваринка, з шерсті якої стікає вода:").lower()
if guess == answer:
    print("Ви - науковець!")

else:
    print("Ні. Співчуваю!")
    
