'''
Більшість років мають 365 днів. 
Однак час, необхідний Землі для обертання навколо Сонця, насправді трохи більше. 
В результаті в деякі роки включається додатковий день, 29 лютого,
щоб виправити цю різницю. Такі роки називають високосними. 
Правила визначення того, високосний рік чи ні, дотримуються:

Будь-який рік, який ділиться на 400, є високосним.
З решти років будь-який рік, який ділиться на 100, не є високосним.
З решти років будь-який рік, який ділиться на 4, є високосним.
Всі інші роки - не високосні.
Напишіть програму, яка читає рік від користувача і виводить повідомлення про те, 
високосний це рік чи ні.

'''

def year_definition(year):
    
    if year % 400 == 0:
        return True
    elif year % 100 == 0:
        return False
    elif year % 4 == 0:
        return True
    else:
        return False

year = int(input("Вкажіть рік:"))
result = year_definition(year) #підставляємо взяте значення у функцію, що приймає аргумент
if result:
    print(f"{year} - високосний рік.")
else:
    print(f"{year} - не високосний рік.")