'''
Напишіть програму, яка починається з читання номіналу банкноти у користувача. 
Потім ваша програма повинна відобразити ім'я фізичної особи, 
яке фігурує на банкноті введеної суми. 
Відповідне повідомлення про помилку має відображатися, 
якщо такої банкноти немає.


'''
def program():
    banknote = input("Вкажіть номінал банкноти:")
    if banknote == "1":
        print("На цій банкноті зображено Володимира Великого.")
    elif banknote == "2":
        print("На цій банкноті зображено Ярослава Мудрого.")
    elif banknote == "5":
        print("На цій банкноті зображено Богдана Хмельницького.")
    elif banknote == "10":
        print("На цій банкноті зображено Івана Мазепу.")
    elif banknote == "20":
        print("На цій банкноті зображено Івана Франка.")
    elif banknote == "50":
        print("На цій банкноті зображено Михайла Грушевського.")
    elif banknote == "100":
        print("На цій банкноті зображено Тараса Шевченка.")
    elif banknote == "200":
        print("На цій банкноті зображено Лесю Українку.")
    elif banknote == "500":
        print("На цій банкноті зображено Григорія Сковороду.")
    elif banknote == "1000":
        print("На цій банкноті зображено Володимира Вернадського.")
    else:
        print("Помилка. Такої банкноти немає.")
        program()
program()