'''
Створіть програму, яка читає місяць і день від користувача.
Користувач введе назву місяця як рядок, а потім день у межах місяця як ціле число. 
Потім у вашій програмі повинен відобразитися сезон, пов'язаний з датою, 
яка була введена.

'''
month = input("Вкажіть назву місяця:").lower()
day = int(input("Вкажіть число місяця:"))
if month == "червень" and day == 23:
    print("Це мій день народження!")
elif month == "грудень" or "січень" or "лютий":
    print("Це зима!")
elif month == "березень" or "квітень" or "травень":
    print("Це весна!")
elif month == "червень" or "липень" or "серпень":
    print("Це літо!")
elif month == "вересень" or "жовтень" or "листопад":
    print("Це осінь!")