'''
Ось це так! 
Ми знайшли скриню зі скарбами! 
Але щоб його відкрити, нам потрібен код. 
Скарби належать таємничій космічній цивілізації, 
в алфавіті якої a символів. 
Всього на скрині b комірок, в кожну з яких можна ввести один символ. 
Скільки комбінацій символів потрібно перебрати?


Користувач вводить два числа - a і b. 
У кожну клітинку можна вставити a різних символів, 
а комірок всього b. 
Для того, щоб обчислити кількість комбінацій, 
необхідно піднести число a в ступінь b.

'''
a = int(input("Введіть кількість символів (a): "))
b = int(input("Введіть кількість комірок (b): "))

combinations = a**b

print(f"Кількість комбінацій: {combinations}")
