'''
Наш робот проаналізував код, і виявилося, що все набагато простіше, 
ніж ми думали! 
Скарби належать таємничій космічній цивілізації, 
в алфавіті якої n символів, а на скрині всього n комірок, 
в кожну з яких потрібно ввести один символ. 
Символи в коді не можуть повторюватися! 
Скільки комбінацій потрібно перебрати?

Користувач вводить число n (n> = 1). 
Виходить, що в першу клітинку можна записати n різних символів, 
у другу n - 1 і так далі. 
Для підрахунку кількості комбінацій необхідно обчислити факторіал числа n, 
який обчислюється за такою формулою
'''
import math

n = int(input("Введіть число n: "))
while n < 1:
    n = int(input("Введіть число >= 1: "))
combinations = math.factorial(n)

print(f"Кількість комбінацій: {combinations}")