'''
Створити гру використовуючи раніше отримані знання 
в таких темах як: 'змінні', 'умовні оператори', 'цикли'.


Вимоги до розробки гри:
1. Придумати сюжет гри та скласти план дій 
(це може бути будь-яка історія на основі вашого улюбленого серіалу, 
мультика, книги чи фільму, а також ваша власна історія).
2. Керуючись планом скласти блок схему всього ігрового процесу, 
від запуску до фіналу.
3. У грі вітається кілька сюжетних ліній, коли гравець, 
вибираючи один із напрямків, проходить гру з позитивним фіналом або негативним.
4. Гра складається із 100 рядків коду, не менше, можна більше.
5. Гравець не гадає, яку відповідь потрібно давати на запитання,
а вибирає із підказок, зазначених у питанні.
6. Обов'язково задається перевірка від неправильного введення відповіді на питання.
7. Змінні у грі несуть смислове навантаження, обов'язково.
8. Не забувате про функції lower(), title(), вони будуть у нагоді!
9. Обов'язково вирішити дане завдання з допомогою ШІ. 
Провести порівняльну характеристику програми ШІ та власноруч написаної
(описати команди і порівняти з використаними Вами), невідомі команди виписати у звіт.
10. Звіт оформити у вигляді MS Word або Google docs, 
обидві програми завантажити на GitHub покликання на репозиторій додати у звіт, 
звіт прикріпити в СДО .  

'''